{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyOLKh7OZ4zRIYVJ4yPuor8s"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["# Задача \\#12\n","\n","> Индекс массы тела (ИМТ) является простым и одновременно важным индикатором состояния здоровья человека. Он рассчитывается как отношение веса человека (в килограммах) к квадрату его роста (в метрах). Если ИМТ находится в пределах от 18,5 до 24,99 включительно, соответствие между массой тела и ростом человека считают нормальным. Значения ниже этого диапазона сигнализируют о недостаточной массе тела, выше — об избыточной массе тела. Помогите врачам автоматизировать принятие решений на основе ИМТ: напишите программу, в которой человек может указать свой вес (weight) и рост (height), а затем   прочитать заключение:  \"Недостаточная масса тела\", \"Норма\", \"Избыточная масса тела\".\n","\n"],"metadata":{"id":"WbeQenfIfr_k"}},{"cell_type":"code","source":["def BMI(weight: float, height: float) -> str:\n","  bmi = weight / height ** 2\n","\n","  if bmi > 24.99:\n","    return \"Избыточная масса тела.\"\n","  elif bmi < 18.5:\n","    return \"Недостаточная масса тела.\"\n","  else:\n","    return \"Норма.\"\n","\n","weight = float(input(\"Введите вес (кг.): \"))\n","height = float(input(\"Введите рост (м.): \"))\n","\n","result = BMI(weight, height)\n","\n","print(result)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"SlhcG0VWcmI-","executionInfo":{"status":"ok","timestamp":1669189607165,"user_tz":-180,"elapsed":11336,"user":{"displayName":"Анастасия Фролова","userId":"00234032503877359163"}},"outputId":"6516ec98-21cb-4531-8e71-2c39292efd61"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите вес (кг.): 75\n","Введите рост (м.): 1.84\n","Норма.\n"]}]},{"cell_type":"markdown","source":["# Задача \\#2\n","\n","> Преподаватель ведёт занятия с 10:30 до 12:00, с 13:40 до 15:00, с 18:00 до 19:30. В университет он приходит в 10 утра, а уходит в 20 часов. Время в университете, свободное от пар, он посвящает консультациям студентов. Напишите программу, которая помогла бы студентам подстроиться под свободное время преподавателя: пусть они вводят желаемое время (сначала одно число - часы (hour), затем второе - минуты (minute)), а программа показывает, свободен преподаватель в это время или нет (выводит на экран \"Преподаватель свободен.\" или \"Преподаватель занят.\" соответственно).\n","\n"],"metadata":{"id":"UJfB1R3UfyYc"}},{"cell_type":"markdown","source":["*Так как время является линейным и нет необходимости временного расчета, можно просто представитть время числом. Например 12ч 15м = 1215, минимальное значение 0 максимальное 2359 и введеное значение будет попадать в этот интревал.*"],"metadata":{"id":"4AYkkfFZRue3"}},{"cell_type":"code","source":["def Teacher(hours: int, minutes: int) -> str:\n","  if 23 < hours or 59 < minutes:\n","    raise ValueError('Max time in format program: 23h 59m')\n","\n","  ust = hours*100 + minutes\n","\n","  if 0 \\\n","      or (1030 <= ust and ust < 1200) \\\n","      or (1340 <= ust and ust < 1500) \\\n","      or (1800 <= ust and ust < 1930):\n","    return \"Преподаватель занят.\"\n","  elif 0 \\\n","      or (0 <= ust and ust < 1030) \\\n","      or (2000 <= ust):\n","    return \"Преподаватель занят.\"\n","  else:\n","    return \"Преподаватель свободен.\"\n","\n","hours = int(input(\"Введите час: \"))\n","minutes = int(input(\"Введите минуты: \"))\n","\n","result = Teacher(hours, minutes)\n","\n","print(result)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"TMu7wvN0QMJu","executionInfo":{"status":"ok","timestamp":1669203871471,"user_tz":-180,"elapsed":22569,"user":{"displayName":"Анастасия Фролова","userId":"00234032503877359163"}},"outputId":"374895d5-220a-46e9-a78e-dedf77eac84b"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите час: 14\n","Введите минуты: 5\n","Преподаватель занят.\n"]}]}]}
